app/controllers/signups_controller.rb

INSERT INTO "signups" ("firstname", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["firstname", "dru"], ["email", "Drewsky5ne@yahoo.com"], ["created_at", "2025-11-04 05:21:09.395167"], ["updated_at", "2025-11-04 05:21:09.395167"]]
---
  def create
    @signup = Signup.new(signup_params)

    if @signup.save